<?php
function marathi_number($number) {
    $words = array(
        0 => 'शून्य',
        1 => 'एक',
        2 => 'दोन',
        3 => 'तीन',
        4 => 'चार',
        5 => 'पाच',
        6 => 'सहा',
        7 => 'सात',
        8 => 'आठ',
        9 => 'नऊ',
        10 => 'दहा',
        11 => 'अकरा',
        12 => 'बारा',
        13 => 'तेरा',
        14 => 'चौदा',
        15 => 'पंधरा',
        16 => 'सोळा',
        17 => 'सतरा',
        18 => 'अठरा',
        19 => 'एकोणीस',
        20 => 'वीस',
        21 => 'एकवीस',
        22 => 'बावीस',
        23 => 'तेवीस',
        24 => 'चोवीस',
        25 => 'पंचवीस',
        26 => 'सहावीस',
        27 => 'सत्तावीस',
        28 => 'अठ्ठावीस',
        29 => 'एकोणतीस',
        30 => 'तीस',
        31 => 'एकतीस',
        32 => 'बत्तीस',
        33 => 'तेहतीस',
        34 => 'चौतीस',
        35 => 'पस्तीस',
        36 => 'छत्तीस',
        37 => 'सदोतीस',
        38 => 'अडोतीस',
        39 => 'एकोणचाळीस',
        40 => 'चाळीस',
        41 => 'एक्केचाळीस',
        42 => 'बेचाळीस',
        43 => 'त्रेचाळीस',
        44 => 'चौरेचाळीस',
        45 => 'पंचेचाळीस',
        46 => 'सेहचाळीस',
        47 => 'सत्तेचाळीस',
        48 => 'अठ्ठेचाळीस',
        49 => 'एकोणपन्नास',
        50 => 'पन्नास',
        51 => 'एकावन्न',
        52 => 'बाव्वन्न',
        53 => 'त्रेपन्न',
        54 => 'चौपन्न',
        55 => 'पंचावन्न',
        56 => 'छप्पन',
        57 => 'सत्तावन्न',
        58 => 'अठ्ठावन्न',
        59 => 'एकोणसाठ',
        60 => 'साठ',
        61 => 'एकसष्ट',
        62 => 'बासष्ट',
        63 => 'त्रेसष्ट',
        64 => 'चौसष्ट',
        65 => 'पासष्ट',
        66 => 'सहासष्ठ',
        67 => 'सदुसष्ट',
        68 => 'अडुसष्ठ',
        69 => 'एकोणसत्तर',
        70 => 'सत्तर',
        71 => 'एकाहत्तर',
        72 => 'बहात्तर',
        73 => 'त्र्याहत्तर',
        74 => 'चौरेहत्तर',
        75 => 'पंचाहत्तर',
        76 => 'शहात्तर',
        77 => 'सत्याहत्तर',
        78 => 'अठ्ठेहत्तर',
        79 => 'एकोणऐंशी',
        80 => 'ऐंशी',
        81 => 'एक्याऐंशी',
        82 => 'ब्याऐंशी',
        83 => 'त्र्याऐंशी',
        84 => 'चौरेऐंशी',
        85 => 'पंच्याऐशी',
        86 => 'सह्यांशी',
        87 => 'सत्तेऐंशी',
        88 => 'अठ्ठ्याऐंशी',
        89 => 'एकोणनव्वद',
        90 => 'नव्वद',
        91 => 'एक्याण्णव',
        92 => 'ब्याण्णव',
        93 => 'त्र्याण्णव',
        94 => 'चौऱ्याण्णव',
        95 => 'पंच्याण्णव',
        96 => 'शह्याण्णव',
        97 => 'सत्त्याण्णव',
        98 => 'अठ्ठ्याण्णव',
        99 => 'नव्व्याण्णव',
        100 => 'शंभर',
        1000 => 'हजार'
    );

    if (!is_numeric($number)) {
        return false;
    }

    $marathi_number = '';

    if (($number >= 0) && ($number <= 99)) {
        $marathi_number = $words[$number];
    }
    else if (($number >= 100) && ($number <= 999)) {
        $marathi_number = $words[floor($number / 100)] . ' ' . $words[100];
        $remainder = $number % 100;
        if ($remainder > 0) {
            $marathi_number .= ' ' . marathi_number($remainder);
        }
    }
    else if (($number >= 1000) && ($number <= 999999)) {
        $marathi_number = marathi_number(floor($number / 1000)) . ' ' . $words[1000];
        $remainder = $number % 1000;
        if ($remainder > 0) {
            $marathi_number .= ' ' . marathi_number($remainder);
        }
    }
    else {
        $marathi_number = false;
    }
    return $marathi_number;
}
function marathi_date($date) {
    $months = [
        "जानेवारी", "फेब्रुवारी", "मार्च", "एप्रिल",
        "मे", "जून", "जुलै", "ऑगस्ट",
        "सप्टेंबर", "ऑक्टोबर", "नोव्हेंबर", "डिसेंबर"
    ];

    
    $str_arr = explode ("/", $date);
    $day = (int)$str_arr[0];
    $month = (int)$str_arr[1];
    $year = (int)$str_arr[2];

    $marathi_date = marathi_number($day)." ".$months[$month-1]." ".marathi_number($year);
    
    return $marathi_date;
}
